## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.cinema will be created
+   resource "digitalocean_kubernetes_cluster" "cinema" {
+       cluster_subnet = (known after apply)
+       created_at     = (known after apply)
+       endpoint       = (known after apply)
+       ha             = false
+       id             = (known after apply)
+       ipv4_address   = (known after apply)
+       kube_config    = (sensitive value)
+       name           = "cinema"
+       region         = "nyc3"
+       service_subnet = (known after apply)
+       status         = (known after apply)
+       surge_upgrade  = true
+       updated_at     = (known after apply)
+       urn            = (known after apply)
+       version        = "1.24.4-do.0"
+       vpc_uuid       = "e65cb1ff-21a1-431f-adc5-dbbb59dcac4c"

+       maintenance_policy {
+           day        = (known after apply)
+           duration   = (known after apply)
+           start_time = (known after apply)
        }

+       node_pool {
+           actual_node_count = (known after apply)
+           auto_scale        = true
+           id                = (known after apply)
+           max_nodes         = 8
+           min_nodes         = 4
+           name              = "core"
+           nodes             = (known after apply)
+           size              = "s-4vcpu-8gb"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
